Revit 2024 API
FabricationConfiguration.SetConfiguration Method (FabricationConfigurationInfo, String)
 Set the fabrication configuration with specific profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void SetConfiguration(
	FabricationConfigurationInfo fabricationConfigurationInfo,
	string profile
)
Visual Basic
Public Sub SetConfiguration ( _
	fabricationConfigurationInfo As FabricationConfigurationInfo, _
	profile As String _
)
Visual C++
public:
void SetConfiguration(
	FabricationConfigurationInfo^ fabricationConfigurationInfo,
	String^ profile
)
Parameters
fabricationConfigurationInfo
Type: Autodesk.Revit.DB.FabricationConfigurationInfo
 The desired fabrication configuration.
profile
Type: System.String
 The desired profile of the fabrication configuration. Use empty string for the global profile.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The profile "profile" is invalid.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The fabrication configuration cannot be swapped because the exiting fabrication configuration has already been used in the document. -or- Cannot set the configuration.
See Also
FabricationConfiguration Class
SetConfiguration Overload
Autodesk.Revit.DB Namespace